# Homebrew Bundle for macOS
# https://github.com/Homebrew/homebrew-bundle
#
# Run `brew bundle` from this repository to sync packages.

# --- Formulae (CLI tools) ---
brew "git"
brew "zsh"

brew "starship"
brew "zoxide"

brew "nvm"
brew "tailscale"
brew "gh"
brew "tmux"
brew "neovim"
brew "fzf"
brew "tree-sitter"
brew "ripgrep"
brew "fd"
brew "bat"
brew "lazygit"
brew "lazydocker"
brew "fastfetch"
brew "btop"
brew "ffmpeg"

brew "python@3.12"
brew "python@3.13"
brew "python@3.14"
brew "pyenv"
brew "pipenv"

brew "go"
brew "rustup"

brew "hugo"





# --- Casks (GUI apps) ---
cask "1password"
cask "1password-cli"

cask "ghostty"
cask "visual-studio-code"
cask "raycast"
cask "spotify"
cask "obsidian"
cask "mac-mouse-fix"
cask "tailscale-app"



# --- Fonts ---
cask "font-jetbrains-mono-nerd-font"
