tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"


# HOMEBREW
brew "aria2"
brew "ast-grep"
brew "bat"
brew "cmatrix"
brew "commitizen"
brew "curl"
brew "diffutils"
brew "docker"
brew "docker-compose"
brew "dotbot"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gifsicle"
brew "git"
brew "git-delta"
brew "go"
brew "graphicsmagick"
brew "grep"
brew "jq"
brew "lazygit"
brew "mpv"
brew "neovim"
brew "node"
brew "nvm"
brew "pipenv"
brew "pnpm"
brew "pyenv"
brew "python@3.13"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
brew "uv"
brew "vips"
brew "wget"
brew "yarn"
brew "zsh"


# CASKS
cask "1password"
cask "1password-cli"
cask "discord"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"
cask "imageoptim"
cask "obs"
cask "visual-studio-code"
cask "brave-browser"
cask "spotify"
cask "raycast"
cask "mac-mouse-fix"
cask "spotify"
cask "ghostty"
